# menu.py

def show_menu():
    print('+'+'-'*32+'+')
    print('|'+'1)  添加学生信息'+' '* 16+'|')
    print('|'+'2)  显示学生信息'+' '* 16+'|')
    print('|'+'3)  删除学生信息'+' '* 16+'|')
    print('|'+'4)  修改学生信息'+' '* 16+'|')
    print('|'+'5)  按学生成绩高-低显示学生信息'+' '+'|')
    print('|'+'6)  按学生成绩低-高显示学生信息'+' '+'|')
    print('|'+'7)  按学生年龄高-低显示学生信息'+' '+'|')
    print('|'+'8)  按学生年龄低-高显示学生信息'+' '+'|')
    print('|'+'9)  保存信息到文件(si.txt)'+' '*6+'|')
    print('|'+'10) 从文件中读取数据(si.txt)'+' '*4+'|')

    print('|'+'q)  退出       '+' '* 17+'|')
    print('+'+'-'*32+'+')